Repository: WP-Translations/WPTypo
Catalog: languages/wptypo-*.po
Languages: fr_fr

source: %s: Settings
fr_fr: %s : Réglages

source: Contents fixing
fr_fr: Correction des contenus

source: Fix to apply
fr_fr: Correction à appliquer

source: Miscellaneous Policies
fr_fr: Diverses politiques

source: Deactivation
fr_fr: Désactivation

source: Remove all of the plugin's data and settings at desactivation
fr_fr: Supprimer tous les réglages lors de la désactivation de l’extension

source: Debugging
fr_fr: Débogage

source: Log information into the browser console (display Developper Tools to show the logs)
fr_fr: Écrire des journaux dans la console du navigateur

source: Titles
fr_fr: Titres

source: Fix all the posts' titles
fr_fr: Corriger tous les titres

source: Contents
fr_fr: Contenus

source: Fix all the posts' contents
fr_fr: Corriger tous les contenus

source: Excerpts
fr_fr: Extraits

source: Fix all the posts' excerpts
fr_fr: Corriger tous les extraits

source: Comments
fr_fr: Commentaires

source: Fix all the comments (content only)
fr_fr: Corriger tous les commentaires (uniquement le contenu)

source: Meta Datas (Beta)
fr_fr: Métadonnées (Bêta)

source: Fix all the posts' meta datas
fr_fr: Corriger toutes les métadonnées

source: Ellipsis
fr_fr: Ellipse

source: Replace all occurences of three dots by an ellipsis
fr_fr: Remplacer toutes les occurences de trois points par une ellipse

source: Detect the letter x between number and replace it by the real math symbol
fr_fr: Détecter la lettre x entre des nombres et la remplacer par le véritable symbole mathématique

source: Dashes
fr_fr: Tiret

source: Replace '-' by ndash '–' (dates ranges) or double-dash -- by a mdash —
fr_fr: Remplacer le tiret simple par un tiret cadratin ou demi-cadratin quand cela est nécessaire (plages de dates, inclusions&hellip;)

source: French quotes
fr_fr: Guillemets à la française

source: Replace dumb quotes " " by smart French style quotation marks « » and use a no break space
fr_fr: Remplacer les guillemets " " par la notation française « » en utilisant les espaces insécables nécessaires

source: French No Break Space
fr_fr: Espaces insécables

source: Replace some classic spaces by non breaking spaces following the French typographic code
fr_fr: Remplacer certains espaces classiques par des espaces insécables, en appliquant les règles typographiques françaises

source: CurlyQuote
fr_fr: Apostrophe

source: Replace straight quotes ' by curly one's ’
fr_fr: Remplacer l'apostophe droite par une apostrophe typographique là où cela sera nécessaire

source: Automatic hyphenation
fr_fr: Trait d'union

source: Enable word hyphenation
fr_fr: Améliorer la détermination de l’endroit où les mots seront coupés en deux (avec un tiret en fin de ligne indiquant l’unité du mot)

source: Replace (r), (c) and (TM) by the right symbols
fr_fr: Remplacer (r), (c), et (TM) par les symboles appropriés

source: Settings
fr_fr: Réglages

source: An explanation of this section...
fr_fr: Une explication de cette section&hellip;

source: Default:
fr_fr: Par défaut :

source: You need to activate something if you want to use the plugin!
fr_fr: Vous devez activer quelque chose si vous voulez utiliser l’extension !

source: must be >= '%s',
fr_fr: doit être >= '%s',

source: so we used the default value instead.
fr_fr: donc nous allons plutôt utiliser la valeur par défaut.

source: must be an integer,
fr_fr: doit être un entier.

source: A plugin for French typography management, powered by JoliTypo
fr_fr: Une extension pour l’implémentation des règles typographiques françaises, utilisant la librairie JoliTypo.
